TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/sysctl/sysctl_ex1_missing_clock_detection/sysctl_ex1_missing_clock_detection.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F29H85x" --package "256ZEX" --part "F29H85x_256ZEX" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @v2CliArgs --device "F29H850TU" --package "256ZEX" --variant "TMS320F29H850TU9" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.02.00"
 * @versions {"tool":"1.25.0+4237"}
 */

    
const divider15       = system.clockTree["PLL_REFDIV"];
divider15.divideValue = 1;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 40;

const mux7       = system.clockTree["OSCCLKSRCSEL"];
mux7.inputSelect = "INTOSC2";


/**
 * Import the modules used in this configuration.
 */
const esm_cpu = scripting.addModule("/driverlib/esm_cpu.js");
const sysctl  = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
esm_cpu.registerNMI = true;

sysctl.clockFail                             = true;
sysctl.ESMConfig_clockfail.inCpu1Esm         = true;
sysctl.ESMConfig_clockfail.esmCPU1.enableNMI = true;
